section .text
palette_data:
	;颜色 00h: 
	db 000h, 000h, 000h 
	;颜色 01h: 
	db 020h, 000h, 000h 
	;颜色 02h: 
	db 000h, 020h, 000h 
	;颜色 03h: 
	db 020h, 020h, 000h 
	;颜色 04h: 
	db 000h, 000h, 020h 
	;颜色 05h: 
	db 020h, 000h, 020h 
	;颜色 06h: 
	db 000h, 020h, 020h 
	;颜色 07h: 
	db 030h, 030h, 030h 
	;颜色 08h: 
	db 030h, 037h, 030h 
	;颜色 09h: 
	db 029h, 032h, 03Ch 
	;颜色 0Ah: 
	db 010h, 008h, 000h 
	;颜色 0Bh: 
	db 018h, 008h, 000h 
	;颜色 0Ch: 
	db 020h, 008h, 000h 
	;颜色 0Dh: 
	db 028h, 008h, 000h 
	;颜色 0Eh: 
	db 030h, 008h, 000h 
	;颜色 0Fh: 
	db 038h, 008h, 000h 
	;颜色 10h: 
	db 000h, 010h, 000h 
	;颜色 11h: 
	db 008h, 010h, 000h 
	;颜色 12h: 
	db 010h, 010h, 000h 
	;颜色 13h: 
	db 018h, 010h, 000h 
	;颜色 14h: 
	db 020h, 010h, 000h 
	;颜色 15h: 
	db 028h, 010h, 000h 
	;颜色 16h: 
	db 030h, 010h, 000h 
	;颜色 17h: 
	db 038h, 010h, 000h 
	;颜色 18h: 
	db 000h, 018h, 000h 
	;颜色 19h: 
	db 008h, 018h, 000h 
	;颜色 1Ah: 
	db 010h, 018h, 000h 
	;颜色 1Bh: 
	db 018h, 018h, 000h 
	;颜色 1Ch: 
	db 020h, 018h, 000h 
	;颜色 1Dh: 
	db 028h, 018h, 000h 
	;颜色 1Eh: 
	db 030h, 018h, 000h 
	;颜色 1Fh: 
	db 038h, 018h, 000h 
	;颜色 20h: 
	db 000h, 020h, 000h 
	;颜色 21h: 
	db 008h, 020h, 000h 
	;颜色 22h: 
	db 010h, 020h, 000h 
	;颜色 23h: 
	db 018h, 020h, 000h 
	;颜色 24h: 
	db 020h, 020h, 000h 
	;颜色 25h: 
	db 028h, 020h, 000h 
	;颜色 26h: 
	db 030h, 020h, 000h 
	;颜色 27h: 
	db 038h, 020h, 000h 
	;颜色 28h: 
	db 000h, 028h, 000h 
	;颜色 29h: 
	db 008h, 028h, 000h 
	;颜色 2Ah: 
	db 010h, 028h, 000h 
	;颜色 2Bh: 
	db 018h, 028h, 000h 
	;颜色 2Ch: 
	db 020h, 028h, 000h 
	;颜色 2Dh: 
	db 028h, 028h, 000h 
	;颜色 2Eh: 
	db 030h, 028h, 000h 
	;颜色 2Fh: 
	db 038h, 028h, 000h 
	;颜色 30h: 
	db 000h, 030h, 000h 
	;颜色 31h: 
	db 008h, 030h, 000h 
	;颜色 32h: 
	db 010h, 030h, 000h 
	;颜色 33h: 
	db 018h, 030h, 000h 
	;颜色 34h: 
	db 020h, 030h, 000h 
	;颜色 35h: 
	db 028h, 030h, 000h 
	;颜色 36h: 
	db 030h, 030h, 000h 
	;颜色 37h: 
	db 038h, 030h, 000h 
	;颜色 38h: 
	db 000h, 038h, 000h 
	;颜色 39h: 
	db 008h, 038h, 000h 
	;颜色 3Ah: 
	db 010h, 038h, 000h 
	;颜色 3Bh: 
	db 018h, 038h, 000h 
	;颜色 3Ch: 
	db 020h, 038h, 000h 
	;颜色 3Dh: 
	db 028h, 038h, 000h 
	;颜色 3Eh: 
	db 030h, 038h, 000h 
	;颜色 3Fh: 
	db 038h, 038h, 000h 
	;颜色 40h: 
	db 000h, 000h, 010h 
	;颜色 41h: 
	db 008h, 000h, 010h 
	;颜色 42h: 
	db 010h, 000h, 010h 
	;颜色 43h: 
	db 018h, 000h, 010h 
	;颜色 44h: 
	db 020h, 000h, 010h 
	;颜色 45h: 
	db 028h, 000h, 010h 
	;颜色 46h: 
	db 030h, 000h, 010h 
	;颜色 47h: 
	db 038h, 000h, 010h 
	;颜色 48h: 
	db 000h, 008h, 010h 
	;颜色 49h: 
	db 008h, 008h, 010h 
	;颜色 4Ah: 
	db 010h, 008h, 010h 
	;颜色 4Bh: 
	db 018h, 008h, 010h 
	;颜色 4Ch: 
	db 020h, 008h, 010h 
	;颜色 4Dh: 
	db 028h, 008h, 010h 
	;颜色 4Eh: 
	db 030h, 008h, 010h 
	;颜色 4Fh: 
	db 038h, 008h, 010h 
	;颜色 50h: 
	db 000h, 010h, 010h 
	;颜色 51h: 
	db 008h, 010h, 010h 
	;颜色 52h: 
	db 010h, 010h, 010h 
	;颜色 53h: 
	db 018h, 010h, 010h 
	;颜色 54h: 
	db 020h, 010h, 010h 
	;颜色 55h: 
	db 028h, 010h, 010h 
	;颜色 56h: 
	db 030h, 010h, 010h 
	;颜色 57h: 
	db 038h, 010h, 010h 
	;颜色 58h: 
	db 000h, 018h, 010h 
	;颜色 59h: 
	db 008h, 018h, 010h 
	;颜色 5Ah: 
	db 010h, 018h, 010h 
	;颜色 5Bh: 
	db 018h, 018h, 010h 
	;颜色 5Ch: 
	db 020h, 018h, 010h 
	;颜色 5Dh: 
	db 028h, 018h, 010h 
	;颜色 5Eh: 
	db 030h, 018h, 010h 
	;颜色 5Fh: 
	db 038h, 018h, 010h 
	;颜色 60h: 
	db 000h, 020h, 010h 
	;颜色 61h: 
	db 008h, 020h, 010h 
	;颜色 62h: 
	db 010h, 020h, 010h 
	;颜色 63h: 
	db 018h, 020h, 010h 
	;颜色 64h: 
	db 020h, 020h, 010h 
	;颜色 65h: 
	db 028h, 020h, 010h 
	;颜色 66h: 
	db 030h, 020h, 010h 
	;颜色 67h: 
	db 038h, 020h, 010h 
	;颜色 68h: 
	db 000h, 028h, 010h 
	;颜色 69h: 
	db 008h, 028h, 010h 
	;颜色 6Ah: 
	db 010h, 028h, 010h 
	;颜色 6Bh: 
	db 018h, 028h, 010h 
	;颜色 6Ch: 
	db 020h, 028h, 010h 
	;颜色 6Dh: 
	db 028h, 028h, 010h 
	;颜色 6Eh: 
	db 030h, 028h, 010h 
	;颜色 6Fh: 
	db 038h, 028h, 010h 
	;颜色 70h: 
	db 000h, 030h, 010h 
	;颜色 71h: 
	db 008h, 030h, 010h 
	;颜色 72h: 
	db 010h, 030h, 010h 
	;颜色 73h: 
	db 018h, 030h, 010h 
	;颜色 74h: 
	db 020h, 030h, 010h 
	;颜色 75h: 
	db 028h, 030h, 010h 
	;颜色 76h: 
	db 030h, 030h, 010h 
	;颜色 77h: 
	db 038h, 030h, 010h 
	;颜色 78h: 
	db 000h, 038h, 010h 
	;颜色 79h: 
	db 008h, 038h, 010h 
	;颜色 7Ah: 
	db 010h, 038h, 010h 
	;颜色 7Bh: 
	db 018h, 038h, 010h 
	;颜色 7Ch: 
	db 020h, 038h, 010h 
	;颜色 7Dh: 
	db 028h, 038h, 010h 
	;颜色 7Eh: 
	db 030h, 038h, 010h 
	;颜色 7Fh: 
	db 038h, 038h, 010h 
	;颜色 80h: 
	db 000h, 000h, 020h 
	;颜色 81h: 
	db 008h, 000h, 020h 
	;颜色 82h: 
	db 010h, 000h, 020h 
	;颜色 83h: 
	db 018h, 000h, 020h 
	;颜色 84h: 
	db 020h, 000h, 020h 
	;颜色 85h: 
	db 028h, 000h, 020h 
	;颜色 86h: 
	db 030h, 000h, 020h 
	;颜色 87h: 
	db 038h, 000h, 020h 
	;颜色 88h: 
	db 000h, 008h, 020h 
	;颜色 89h: 
	db 008h, 008h, 020h 
	;颜色 8Ah: 
	db 010h, 008h, 020h 
	;颜色 8Bh: 
	db 018h, 008h, 020h 
	;颜色 8Ch: 
	db 020h, 008h, 020h 
	;颜色 8Dh: 
	db 028h, 008h, 020h 
	;颜色 8Eh: 
	db 030h, 008h, 020h 
	;颜色 8Fh: 
	db 038h, 008h, 020h 
	;颜色 90h: 
	db 000h, 010h, 020h 
	;颜色 91h: 
	db 008h, 010h, 020h 
	;颜色 92h: 
	db 010h, 010h, 020h 
	;颜色 93h: 
	db 018h, 010h, 020h 
	;颜色 94h: 
	db 020h, 010h, 020h 
	;颜色 95h: 
	db 028h, 010h, 020h 
	;颜色 96h: 
	db 030h, 010h, 020h 
	;颜色 97h: 
	db 038h, 010h, 020h 
	;颜色 98h: 
	db 000h, 018h, 020h 
	;颜色 99h: 
	db 008h, 018h, 020h 
	;颜色 9Ah: 
	db 010h, 018h, 020h 
	;颜色 9Bh: 
	db 018h, 018h, 020h 
	;颜色 9Ch: 
	db 020h, 018h, 020h 
	;颜色 9Dh: 
	db 028h, 018h, 020h 
	;颜色 9Eh: 
	db 030h, 018h, 020h 
	;颜色 9Fh: 
	db 038h, 018h, 020h 
	;颜色 A0h: 
	db 000h, 020h, 020h 
	;颜色 A1h: 
	db 008h, 020h, 020h 
	;颜色 A2h: 
	db 010h, 020h, 020h 
	;颜色 A3h: 
	db 018h, 020h, 020h 
	;颜色 A4h: 
	db 020h, 020h, 020h 
	;颜色 A5h: 
	db 028h, 020h, 020h 
	;颜色 A6h: 
	db 030h, 020h, 020h 
	;颜色 A7h: 
	db 038h, 020h, 020h 
	;颜色 A8h: 
	db 000h, 028h, 020h 
	;颜色 A9h: 
	db 008h, 028h, 020h 
	;颜色 AAh: 
	db 010h, 028h, 020h 
	;颜色 ABh: 
	db 018h, 028h, 020h 
	;颜色 ACh: 
	db 020h, 028h, 020h 
	;颜色 ADh: 
	db 028h, 028h, 020h 
	;颜色 AEh: 
	db 030h, 028h, 020h 
	;颜色 AFh: 
	db 038h, 028h, 020h 
	;颜色 B0h: 
	db 000h, 030h, 020h 
	;颜色 B1h: 
	db 008h, 030h, 020h 
	;颜色 B2h: 
	db 010h, 030h, 020h 
	;颜色 B3h: 
	db 018h, 030h, 020h 
	;颜色 B4h: 
	db 020h, 030h, 020h 
	;颜色 B5h: 
	db 028h, 030h, 020h 
	;颜色 B6h: 
	db 030h, 030h, 020h 
	;颜色 B7h: 
	db 038h, 030h, 020h 
	;颜色 B8h: 
	db 000h, 038h, 020h 
	;颜色 B9h: 
	db 008h, 038h, 020h 
	;颜色 BAh: 
	db 010h, 038h, 020h 
	;颜色 BBh: 
	db 018h, 038h, 020h 
	;颜色 BCh: 
	db 020h, 038h, 020h 
	;颜色 BDh: 
	db 028h, 038h, 020h 
	;颜色 BEh: 
	db 030h, 038h, 020h 
	;颜色 BFh: 
	db 038h, 038h, 020h 
	;颜色 C0h: 
	db 000h, 000h, 030h 
	;颜色 C1h: 
	db 008h, 000h, 030h 
	;颜色 C2h: 
	db 010h, 000h, 030h 
	;颜色 C3h: 
	db 018h, 000h, 030h 
	;颜色 C4h: 
	db 020h, 000h, 030h 
	;颜色 C5h: 
	db 028h, 000h, 030h 
	;颜色 C6h: 
	db 030h, 000h, 030h 
	;颜色 C7h: 
	db 038h, 000h, 030h 
	;颜色 C8h: 
	db 000h, 008h, 030h 
	;颜色 C9h: 
	db 008h, 008h, 030h 
	;颜色 CAh: 
	db 010h, 008h, 030h 
	;颜色 CBh: 
	db 018h, 008h, 030h 
	;颜色 CCh: 
	db 020h, 008h, 030h 
	;颜色 CDh: 
	db 028h, 008h, 030h 
	;颜色 CEh: 
	db 030h, 008h, 030h 
	;颜色 CFh: 
	db 038h, 008h, 030h 
	;颜色 D0h: 
	db 000h, 010h, 030h 
	;颜色 D1h: 
	db 008h, 010h, 030h 
	;颜色 D2h: 
	db 010h, 010h, 030h 
	;颜色 D3h: 
	db 018h, 010h, 030h 
	;颜色 D4h: 
	db 020h, 010h, 030h 
	;颜色 D5h: 
	db 028h, 010h, 030h 
	;颜色 D6h: 
	db 030h, 010h, 030h 
	;颜色 D7h: 
	db 038h, 010h, 030h 
	;颜色 D8h: 
	db 000h, 018h, 030h 
	;颜色 D9h: 
	db 008h, 018h, 030h 
	;颜色 DAh: 
	db 010h, 018h, 030h 
	;颜色 DBh: 
	db 018h, 018h, 030h 
	;颜色 DCh: 
	db 020h, 018h, 030h 
	;颜色 DDh: 
	db 028h, 018h, 030h 
	;颜色 DEh: 
	db 030h, 018h, 030h 
	;颜色 DFh: 
	db 038h, 018h, 030h 
	;颜色 E0h: 
	db 000h, 020h, 030h 
	;颜色 E1h: 
	db 008h, 020h, 030h 
	;颜色 E2h: 
	db 010h, 020h, 030h 
	;颜色 E3h: 
	db 018h, 020h, 030h 
	;颜色 E4h: 
	db 020h, 020h, 030h 
	;颜色 E5h: 
	db 028h, 020h, 030h 
	;颜色 E6h: 
	db 030h, 020h, 030h 
	;颜色 E7h: 
	db 038h, 020h, 030h 
	;颜色 E8h: 
	db 000h, 028h, 030h 
	;颜色 E9h: 
	db 008h, 028h, 030h 
	;颜色 EAh: 
	db 010h, 028h, 030h 
	;颜色 EBh: 
	db 018h, 028h, 030h 
	;颜色 ECh: 
	db 020h, 028h, 030h 
	;颜色 EDh: 
	db 028h, 028h, 030h 
	;颜色 EEh: 
	db 030h, 028h, 030h 
	;颜色 EFh: 
	db 038h, 028h, 030h 
	;颜色 F0h: 
	db 000h, 030h, 030h 
	;颜色 F1h: 
	db 008h, 030h, 030h 
	;颜色 F2h: 
	db 010h, 030h, 030h 
	;颜色 F3h: 
	db 018h, 030h, 030h 
	;颜色 F4h: 
	db 020h, 030h, 030h 
	;颜色 F5h: 
	db 028h, 030h, 030h 
	;颜色 F6h: 
	db 03Fh, 03Eh, 03Ch 
	;颜色 F7h: 
	db 028h, 028h, 029h 
	;颜色 F8h: 
	db 020h, 020h, 020h 
	;颜色 F9h: 
	db 03Fh, 000h, 000h 
	;颜色 FAh: 
	db 000h, 03Fh, 000h 
	;颜色 FBh: 
	db 03Fh, 03Fh, 000h 
	;颜色 FCh: 
	db 000h, 000h, 03Fh 
	;颜色 FDh: 
	db 03Fh, 000h, 03Fh 
	;颜色 FEh: 
	db 000h, 03Fh, 03Fh 
	;颜色 FFh: 
	db 03Fh, 03Fh, 03Fh 
